; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	spectrograph0 - mode
	infrared3 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	thermograph4 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation12 - direction
	Star13 - direction
	Star20 - direction
	GroundStation22 - direction
	Star23 - direction
	GroundStation26 - direction
	GroundStation27 - direction
	Star29 - direction
	Star30 - direction
	GroundStation31 - direction
	Star32 - direction
	GroundStation34 - direction
	Star35 - direction
	GroundStation21 - direction
	Star15 - direction
	Star1 - direction
	Star39 - direction
	GroundStation37 - direction
	GroundStation18 - direction
	GroundStation2 - direction
	GroundStation24 - direction
	Star11 - direction
	Star19 - direction
	GroundStation16 - direction
	GroundStation28 - direction
	GroundStation36 - direction
	Star25 - direction
	Star8 - direction
	Star6 - direction
	Star0 - direction
	GroundStation4 - direction
	Star38 - direction
	Star7 - direction
	GroundStation33 - direction
	GroundStation14 - direction
	GroundStation17 - direction
	Star40 - direction
	Star41 - direction
	Phenomenon42 - direction
	Phenomenon43 - direction
	Phenomenon44 - direction
	Planet45 - direction
	Planet46 - direction
	Star47 - direction
	Star48 - direction
	Phenomenon49 - direction
	Planet50 - direction
	Star51 - direction
	Phenomenon52 - direction
	Planet53 - direction
	Planet54 - direction
	Star55 - direction
	Star56 - direction
	Planet57 - direction
	Planet58 - direction
	Planet59 - direction
	Planet60 - direction
	Star61 - direction
	Star62 - direction
	Planet63 - direction
	Phenomenon64 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star35)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation21)
	(calibration_target instrument0 Star38)
	(calibration_target instrument0 GroundStation24)
	(calibration_target instrument0 GroundStation37)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation14)
	(calibration_target instrument1 GroundStation21)
	(calibration_target instrument1 GroundStation24)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation28)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star38)
	(calibration_target instrument2 GroundStation37)
	(calibration_target instrument2 Star39)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star15)
	(calibration_target instrument2 GroundStation33)
	(supports instrument3 spectrograph2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation28)
	(calibration_target instrument3 GroundStation16)
	(calibration_target instrument3 Star19)
	(calibration_target instrument3 Star25)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation14)
	(calibration_target instrument3 GroundStation24)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation18)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star35)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 Star25)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation36)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation17)
	(calibration_target instrument5 GroundStation14)
	(calibration_target instrument5 GroundStation33)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star38)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star8)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation28)
)
(:goal (and
	(pointing satellite1 Star51)
	(pointing satellite2 GroundStation17)
	(pointing satellite3 Star32)
	(have_image Star40 spectrograph1)
	(have_image Star41 spectrograph0)
	(have_image Phenomenon42 infrared3)
	(have_image Phenomenon43 spectrograph2)
	(have_image Phenomenon44 spectrograph1)
	(have_image Planet45 infrared3)
	(have_image Planet46 spectrograph0)
	(have_image Star47 thermograph4)
	(have_image Star48 thermograph4)
	(have_image Phenomenon49 infrared3)
	(have_image Planet50 spectrograph0)
	(have_image Star51 infrared3)
	(have_image Phenomenon52 spectrograph1)
	(have_image Planet53 spectrograph1)
	(have_image Planet54 spectrograph0)
	(have_image Star55 spectrograph2)
	(have_image Star56 spectrograph0)
	(have_image Planet57 spectrograph0)
	(have_image Planet58 spectrograph0)
	(have_image Planet59 spectrograph1)
	(have_image Planet60 spectrograph2)
	(have_image Star61 spectrograph1)
	(have_image Star62 thermograph4)
	(have_image Planet63 infrared3)
	(have_image Phenomenon64 infrared3)
))

)

; plan
1. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 28
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 28
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 28
4. (turn_to satellite3 phenomenon42 groundstation28)
   deleted: (pointing satellite3 groundstation28)
   added: (pointing satellite3 phenomenon42)
   goals met: 0 of 28
5. (turn_to satellite2 groundstation17 groundstation14)
   deleted: (pointing satellite2 groundstation14)
   added: (pointing satellite2 groundstation17)
   goals met: 1 of 28
6. (turn_to satellite1 star51 star35)
   deleted: (pointing satellite1 star35)
   added: (pointing satellite1 star51)
   goals met: 2 of 28
7. (turn_to satellite0 groundstation24 groundstation28)
   deleted: (pointing satellite0 groundstation28)
   added: (pointing satellite0 groundstation24)
   goals met: 2 of 28
8. (calibrate satellite0 instrument1 groundstation24)
   added: (calibrated instrument1)
   goals met: 2 of 28
9. (turn_to satellite0 phenomenon43 groundstation24)
   deleted: (pointing satellite0 groundstation24)
   added: (pointing satellite0 phenomenon43)
   goals met: 2 of 28
10. (take_image satellite0 phenomenon43 instrument1 spectrograph2)
   added: (have_image phenomenon43 spectrograph2)
   goals met: 3 of 28
11. (turn_to satellite0 phenomenon44 phenomenon43)
   deleted: (pointing satellite0 phenomenon43)
   added: (pointing satellite0 phenomenon44)
   goals met: 3 of 28
12. (take_image satellite0 phenomenon44 instrument1 spectrograph1)
   added: (have_image phenomenon44 spectrograph1)
   goals met: 4 of 28
13. (turn_to satellite0 phenomenon52 phenomenon44)
   deleted: (pointing satellite0 phenomenon44)
   added: (pointing satellite0 phenomenon52)
   goals met: 4 of 28
14. (take_image satellite0 phenomenon52 instrument1 spectrograph1)
   added: (have_image phenomenon52 spectrograph1)
   goals met: 5 of 28
15. (turn_to satellite0 planet46 phenomenon52)
   deleted: (pointing satellite0 phenomenon52)
   added: (pointing satellite0 planet46)
   goals met: 5 of 28
16. (take_image satellite0 planet46 instrument1 spectrograph0)
   added: (have_image planet46 spectrograph0)
   goals met: 6 of 28
17. (turn_to satellite0 planet50 planet46)
   deleted: (pointing satellite0 planet46)
   added: (pointing satellite0 planet50)
   goals met: 6 of 28
18. (take_image satellite0 planet50 instrument1 spectrograph0)
   added: (have_image planet50 spectrograph0)
   goals met: 7 of 28
19. (turn_to satellite0 planet53 planet50)
   deleted: (pointing satellite0 planet50)
   added: (pointing satellite0 planet53)
   goals met: 7 of 28
20. (take_image satellite0 planet53 instrument1 spectrograph1)
   added: (have_image planet53 spectrograph1)
   goals met: 8 of 28
21. (turn_to satellite0 planet54 planet53)
   deleted: (pointing satellite0 planet53)
   added: (pointing satellite0 planet54)
   goals met: 8 of 28
22. (take_image satellite0 planet54 instrument1 spectrograph0)
   added: (have_image planet54 spectrograph0)
   goals met: 9 of 28
23. (turn_to satellite0 planet57 planet54)
   deleted: (pointing satellite0 planet54)
   added: (pointing satellite0 planet57)
   goals met: 9 of 28
24. (take_image satellite0 planet57 instrument1 spectrograph0)
   added: (have_image planet57 spectrograph0)
   goals met: 10 of 28
25. (turn_to satellite0 planet58 planet57)
   deleted: (pointing satellite0 planet57)
   added: (pointing satellite0 planet58)
   goals met: 10 of 28
26. (take_image satellite0 planet58 instrument1 spectrograph0)
   added: (have_image planet58 spectrograph0)
   goals met: 11 of 28
27. (turn_to satellite0 planet59 planet58)
   deleted: (pointing satellite0 planet58)
   added: (pointing satellite0 planet59)
   goals met: 11 of 28
28. (take_image satellite0 planet59 instrument1 spectrograph1)
   added: (have_image planet59 spectrograph1)
   goals met: 12 of 28
29. (turn_to satellite0 planet60 planet59)
   deleted: (pointing satellite0 planet59)
   added: (pointing satellite0 planet60)
   goals met: 12 of 28
30. (take_image satellite0 planet60 instrument1 spectrograph2)
   added: (have_image planet60 spectrograph2)
   goals met: 13 of 28
31. (turn_to satellite0 star40 planet60)
   deleted: (pointing satellite0 planet60)
   added: (pointing satellite0 star40)
   goals met: 13 of 28
32. (take_image satellite0 star40 instrument1 spectrograph1)
   added: (have_image star40 spectrograph1)
   goals met: 14 of 28
33. (turn_to satellite0 star41 star40)
   deleted: (pointing satellite0 star40)
   added: (pointing satellite0 star41)
   goals met: 14 of 28
34. (take_image satellite0 star41 instrument1 spectrograph0)
   added: (have_image star41 spectrograph0)
   goals met: 15 of 28
35. (turn_to satellite0 star55 star41)
   deleted: (pointing satellite0 star41)
   added: (pointing satellite0 star55)
   goals met: 15 of 28
36. (take_image satellite0 star55 instrument1 spectrograph2)
   added: (have_image star55 spectrograph2)
   goals met: 16 of 28
37. (turn_to satellite0 star56 star55)
   deleted: (pointing satellite0 star55)
   added: (pointing satellite0 star56)
   goals met: 16 of 28
38. (take_image satellite0 star56 instrument1 spectrograph0)
   added: (have_image star56 spectrograph0)
   goals met: 17 of 28
39. (turn_to satellite0 star61 star56)
   deleted: (pointing satellite0 star56)
   added: (pointing satellite0 star61)
   goals met: 17 of 28
40. (take_image satellite0 star61 instrument1 spectrograph1)
   added: (have_image star61 spectrograph1)
   goals met: 18 of 28
41. (turn_to satellite3 star8 phenomenon42)
   deleted: (pointing satellite3 phenomenon42)
   added: (pointing satellite3 star8)
   goals met: 18 of 28
42. (calibrate satellite3 instrument5 star8)
   added: (calibrated instrument5)
   goals met: 18 of 28
43. (turn_to satellite3 phenomenon42 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon42)
   goals met: 18 of 28
44. (take_image satellite3 phenomenon42 instrument5 infrared3)
   added: (have_image phenomenon42 infrared3)
   goals met: 19 of 28
45. (turn_to satellite3 phenomenon49 phenomenon42)
   deleted: (pointing satellite3 phenomenon42)
   added: (pointing satellite3 phenomenon49)
   goals met: 19 of 28
46. (take_image satellite3 phenomenon49 instrument5 infrared3)
   added: (have_image phenomenon49 infrared3)
   goals met: 20 of 28
47. (turn_to satellite3 phenomenon64 phenomenon49)
   deleted: (pointing satellite3 phenomenon49)
   added: (pointing satellite3 phenomenon64)
   goals met: 20 of 28
48. (take_image satellite3 phenomenon64 instrument5 infrared3)
   added: (have_image phenomenon64 infrared3)
   goals met: 21 of 28
49. (turn_to satellite3 planet45 phenomenon64)
   deleted: (pointing satellite3 phenomenon64)
   added: (pointing satellite3 planet45)
   goals met: 21 of 28
50. (take_image satellite3 planet45 instrument5 infrared3)
   added: (have_image planet45 infrared3)
   goals met: 22 of 28
51. (turn_to satellite3 planet63 planet45)
   deleted: (pointing satellite3 planet45)
   added: (pointing satellite3 planet63)
   goals met: 22 of 28
52. (take_image satellite3 planet63 instrument5 infrared3)
   added: (have_image planet63 infrared3)
   goals met: 23 of 28
53. (turn_to satellite3 star32 planet63)
   deleted: (pointing satellite3 planet63)
   added: (pointing satellite3 star32)
   goals met: 24 of 28
54. (turn_to satellite3 star51 star32)
   deleted: (pointing satellite3 star32)
   added: (pointing satellite3 star51)
   goals met: 23 of 28
55. (take_image satellite3 star51 instrument5 infrared3)
   added: (have_image star51 infrared3)
   goals met: 24 of 28
56. (turn_to satellite3 star32 star51)
   deleted: (pointing satellite3 star51)
   added: (pointing satellite3 star32)
   goals met: 25 of 28
57. (turn_to satellite2 star25 groundstation17)
   deleted: (pointing satellite2 groundstation17)
   added: (pointing satellite2 star25)
   goals met: 24 of 28
58. (calibrate satellite2 instrument4 star25)
   added: (calibrated instrument4)
   goals met: 24 of 28
59. (turn_to satellite2 groundstation17 star25)
   deleted: (pointing satellite2 star25)
   added: (pointing satellite2 groundstation17)
   goals met: 25 of 28
60. (turn_to satellite2 star47 groundstation17)
   deleted: (pointing satellite2 groundstation17)
   added: (pointing satellite2 star47)
   goals met: 24 of 28
61. (take_image satellite2 star47 instrument4 thermograph4)
   added: (have_image star47 thermograph4)
   goals met: 25 of 28
62. (turn_to satellite2 groundstation17 star47)
   deleted: (pointing satellite2 star47)
   added: (pointing satellite2 groundstation17)
   goals met: 26 of 28
63. (turn_to satellite2 star48 groundstation17)
   deleted: (pointing satellite2 groundstation17)
   added: (pointing satellite2 star48)
   goals met: 25 of 28
64. (take_image satellite2 star48 instrument4 thermograph4)
   added: (have_image star48 thermograph4)
   goals met: 26 of 28
65. (turn_to satellite2 groundstation17 star48)
   deleted: (pointing satellite2 star48)
   added: (pointing satellite2 groundstation17)
   goals met: 27 of 28
66. (turn_to satellite2 star62 groundstation17)
   deleted: (pointing satellite2 groundstation17)
   added: (pointing satellite2 star62)
   goals met: 26 of 28
67. (take_image satellite2 star62 instrument4 thermograph4)
   added: (have_image star62 thermograph4)
   goals met: 27 of 28
68. (turn_to satellite2 groundstation17 star62)
   deleted: (pointing satellite2 star62)
   added: (pointing satellite2 groundstation17)
   goals met: 28 of 28
